#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bizkt/restricted-buckets/runs/run-RU1yhqR6ZpNa5Kry

Waiting for the plan to start...

Terraform v1.7.2
on linux_amd64
Initializing plugins and modules...
module.iam.data.aws_iam_policy_document.restricted_bucket_custom_policy: Refreshing...
module.iam.aws_iam_role.restricted_bucket_role: Refreshing state... [id=my-bucket-0222024]
module.iam.data.aws_iam_policy.view_only_access: Refreshing...
module.buckets.aws_s3_bucket_policy.my-buckets-access-policy: Refreshing state... [id=my-bucket-0222024]
module.buckets.aws_s3_bucket.restricted_bucket: Refreshing state... [id=my-bucket-0222024]
module.iam.data.aws_iam_policy_document.restricted_bucket_custom_policy: Refresh complete after 0s [id=3468000586]
module.iam.aws_iam_policy.restricted_bucket_custom_policy: Refreshing state... [id=arn:aws:iam::788454291550:policy/my-buckets-access-policy]
module.iam.data.aws_iam_policy.view_only_access: Refresh complete after 1s [id=arn:aws:iam::aws:policy/job-function/ViewOnlyAccess]
module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["my-buckets-access-policy"]: Refreshing state... [id=restricted-bucket-viwer-policy-attachment]
module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["view_only_access"]: Refreshing state... [id=restricted-bucket-viwer-policy-attachment]
module.buckets.aws_s3_bucket_public_access_block.restricted_bucket: Refreshing state... [id=my-bucket-0222024]
module.buckets.data.aws_iam_policy_document.restricted-bucket-access-policy: Refreshing...
module.buckets.data.aws_iam_policy_document.restricted-bucket-access-policy: Refresh complete after 0s [id=556344345]
module.buckets.aws_s3_bucket.restricted_bucket: Drift detected (update)
module.iam.aws_iam_role.restricted_bucket_role: Drift detected (update)
module.iam.aws_iam_policy.restricted_bucket_custom_policy: Drift detected (update)
module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["my-buckets-access-policy"]: Drift detected (update)
module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["view_only_access"]: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-RU1yhqR6ZpNa5Kry/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-RU1yhqR6ZpNa5Kry/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_policy.my-buckets-access-policy will be destroyed
  # (because aws_s3_bucket_policy.my-buckets-access-policy is not in configuration)
  - resource "aws_s3_bucket_policy" "my-buckets-access-policy" {
      - bucket = "my-bucket-0222024" -> null
      - id     = "my-bucket-0222024" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::788454291550:role/my-bucket-0222024"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::my-bucket-0222024/*",
                          - "arn:aws:s3:::my-bucket-0222024",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.buckets.aws_s3_bucket_policy.restricted-bucket-access-policy will be created
  + resource "aws_s3_bucket_policy" "restricted-bucket-access-policy" {
      + bucket = "my-bucket-0222024"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::788454291550:role/my-bucket-0222024"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::my-bucket-0222024/*",
                          + "arn:aws:s3:::my-bucket-0222024",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.iam.aws_iam_policy.restricted_bucket_custom_policy must be replaced
-/+ resource "aws_iam_policy" "restricted_bucket_custom_policy" {
      ~ arn         = "arn:aws:iam::788454291550:policy/my-buckets-access-policy" -> (known after apply)
      ~ id          = "arn:aws:iam::788454291550:policy/my-buckets-access-policy" -> (known after apply)
      ~ name        = "my-buckets-access-policy" -> "restricted-buckets-access-policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPA3PE4JXBPGZ3Z57FHV" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam.aws_iam_policy_attachment.restricted_bucket_policy_attachment["my-buckets-access-policy"] must be replaced
-/+ resource "aws_iam_policy_attachment" "restricted_bucket_policy_attachment" {
      - groups     = [] -> null
      ~ id         = "restricted-bucket-viwer-policy-attachment" -> (known after apply)
        name       = "restricted-bucket-viwer-policy-attachment"
      ~ policy_arn = "arn:aws:iam::788454291550:policy/my-buckets-access-policy" # forces replacement -> (known after apply) # forces replacement
      - users      = [] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 0 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @krishanthisera, Action: `pull_request`, Workflow: `Terraform Plan`*